In [1]:
#################################################
# Dependencies
#################################################
import pandas as pd
import sqlalchemy
from sqlalchemy import create_engine, MetaData, func #connect to database
# from sqlalchemy.ext.declarative import declarative_base #classes into tables
from sqlalchemy import Column, Integer, String, Float, Date, VARCHAR #allow us to declare column typs
from sqlalchemy.dialects.mysql import LONGTEXT
from sqlalchemy.orm import Session
from sqlalchemy.ext.automap import automap_base
import pymysql
# pymysql.install_as_MySQLdb() # starts creating connection from Python to SQL database

from dataEngineering import choroplethCoords, ucrData, schoolShootings

In [2]:
#################################################
# Engine Setup
#################################################
# engine = create_engine('sqlite:///data/data.sqlite')
engine = create_engine('postgres://lqehqdnexeuwdi:e299f2b76843b838b81976e7cb183859f28b1cd99e6aa417fdce1340ce00fece@ec2-54-243-210-70.compute-1.amazonaws.com:5432/dbenqc5p6hbe3e')
# engine = create_engine('mysql://root:0i5JwkgSIOzEp1I@localhost:3306/CrimeMapping')
# engine = create_engine('postgresql://nupur_mathur:1BPdfWvnTSvMGDrPp48u5pQF0@localhost/crime_data')

# Create connection
conn = engine.connect()

In [3]:
meta = MetaData()
meta.reflect(bind=engine)
for table in reversed(meta.sorted_tables):
    print (table)

vcr
state_coordinates
school_shootings

In [ ]:
#################################################
# Add Tables from DFs
#################################################
# # Create cleaned dataframes from raw sources:
# vcrData = ucrData('data/raw/ucr_violent_crime_rate_by_state.csv')
# choroplethCoordsData = choroplethCoords()
# schoolShootingsData = schoolShootings()

# # Convert DF into DB tables (and create primary key)
# # conn.execute('DROP TABLE IF EXISTS vcr;')
# ucrData.to_sql(name='vcr', con=engine, if_exists = 'replace', index=True)
# conn.execute('ALTER TABLE vcr ADD PRIMARY KEY (index);')

# # conn.execute('DROP TABLE IF EXISTS state_coordinates;')
# choroplethCoordsData.to_sql(name='state_coordinates', con=engine, if_exists = 'replace', index=True)
# conn.execute('ALTER TABLE state_coordinates ADD PRIMARY KEY (index);')

# # conn.execute('DROP TABLE IF EXISTS school_shootings;')
# schoolShootingsData.to_sql(name='school_shootings', con=engine, if_exists = 'replace', index=True)
# conn.execute('ALTER TABLE school_shootings ADD PRIMARY KEY (index);')

In [4]:
# unemploymentData = ucrData('raw/unemployment_by_state.csv')
# medHouseIncomeData = ucrData('raw/census_median_household_income.csv')
# medHouseIncomeSterrData = ucrData('raw/census_median_household_income_stderr.csv')
murderData = ucrData('raw/ucr_murder_and_nonnegligent_manslaughter.csv')
violentCrimeData = ucrData('raw/ucr_violent_crime_total.csv')

In [5]:
murderData.head()

Year,state,1990,1991,1992,1993,1994,1995,1996,1997,1998,...,2006,2007,2008,2009,2010,2011,2012,2013,2014,stateId
0,Alabama,467,469,455,484,501,475,444,426,354,...,382,412,351,322,275,299,342,346,276,01
1,Alaska,41,42,44,54,38,55,45,54,41,...,36,43,27,22,31,30,30,34,41,02
2,Arizona,284,291,312,339,426,439,377,375,376,...,533,548,462,380,408,397,358,355,319,04
3,Arkansas,241,264,259,247,294,259,219,250,201,...,205,198,165,179,134,160,174,158,165,05
4,California,3553,3859,3921,4096,3703,3531,2916,2579,2171,...,2486,2262,2142,1972,1809,1792,1884,1746,1699,06

In [6]:
violentCrimeData.head()

Year,state,1990,1991,1992,1993,1994,1995,1996,1997,1998,...,2006,2007,2008,2009,2010,2011,2012,2013,2014,stateId
0,Alabama,28630,34518,36052,32676,28844,26894,24159,24379,22286,...,19553,20775,21110,21194,18363,20166,21693,20834,20727,01
1,Alaska,2885,3499,3877,4557,4644,4656,4417,4270,4015,...,4610,4520,4475,4424,4537,4416,4412,4709,4684,02
2,Arizona,23911,25152,25706,28142,28653,30095,27963,28411,26984,...,33456,32835,31567,28128,26528,26789,28077,27576,26916,04
3,Arkansas,12511,14072,13831,14381,14598,13741,13161,13293,12442,...,15538,15226,14649,14905,14711,14173,13851,13705,14243,05
4,California,311051,331122,345624,336381,318395,305154,274996,257582,229883,...,194483,191561,185329,174934,164133,154943,160944,154739,153709,06

In [11]:
# unemploymentData = ucrData('raw/unemployment_by_state.csv')
medHouseIncomeData = ucrData('raw/clean_census_median_household_income_stderr.csv')
medHouseIncomeSterrData = ucrData('raw/clean_census_median_household_income.csv')
populationData = ucrData('raw/clean_population_by_year.csv')

In [9]:
medHouseIncomeData.head()

Year,state,1990,1991,1992,1993,1994,1995,1996,1997,1998,...,2008,2009,2010,2011,2012,2013,2014,2015,2016,stateId
0,Alabama,1037,1068,1058,1088,1559,1266,1258,1607,1307,...,1659,904,2396,2021,2529,5511,1529,3419,2301,01
1,Alaska,1627,1822,1156,1643,1494,2008,1907,1258,2124,...,2302,1751,2390,3710,2839,5446,3153,3485,4086,02
2,Arizona,1141,897,1088,1120,773,1360,1274,1297,1255,...,1125,1241,2227,2424,2922,4365,2304,2008,1971,04
3,Arkansas,981,783,1398,847,944,999,978,1154,1160,...,1194,909,2464,1849,2812,2402,2546,1572,2165,05
4,California,565,685,629,651,619,723,818,864,577,...,829,619,1182,1378,1238,1811,894,1711,1075,06

In [13]:
medHouseIncomeSterrData.head()

Year,state,1990,1991,1992,1993,1994,1995,1996,1997,1998,...,2008,2009,2010,2011,2012,2013,2014,2015,2016,stateId
0,Alabama,23357,24346,25808,25082,27196,25991,30302,31939,36266,...,44476,39980,40933,42590,43464,47320,42278,44509,47221,01
1,Alaska,39298,40612,41802,42931,45367,47954,52779,47994,50692,...,63989,61604,57848,57431,63648,72472,67629,75112,75723,02
2,Arizona,29224,30737,29358,30510,31293,30863,31637,32740,37090,...,46914,45739,46896,48621,47044,52611,49254,52248,57100,04
3,Arkansas,22786,23435,23882,23039,25565,25814,27123,26162,27665,...,39586,36538,38587,41302,39018,39376,44922,42798,45907,05
4,California,33290,33664,34903,34073,35331,37009,38812,39694,40934,...,57014,56134,54283,53367,57020,60794,60487,63636,66637,06

In [12]:
populationData.head()

Year,state,1990,1991,1992,1993,1994,1995,1996,1997,1998,...,2009,2010,2011,2012,2013,2014,2015,2016,2017,stateId
0,Alabama,4050055,4099156,4154014,4214202,4260229,4296800,4331102,4367935,4404701,...,4757938,4785579,4798649,4813946,4827660,4840037,4850858,4860545,4874747,01
1,Alaska,553290,570193,588736,599432,603308,604412,608569,612968,619932,...,698895,714015,722259,730825,736760,736759,737979,741522,739795,02
2,Arizona,3684097,3788576,3915740,4065440,4245089,4432499,4586940,4736990,4883342,...,6343154,6407002,6465488,6544211,6616124,6706435,6802262,6908642,7016270,04
3,Arkansas,2356586,2383144,2415984,2456303,2494019,2535399,2572109,2601090,2626289,...,2896843,2921737,2938640,2949208,2956780,2964800,2975626,2988231,3004279,05
4,California,29959515,30470736,30974659,31274928,31484435,31696582,32018834,32486010,32987675,...,36961229,37327690,37672654,38019006,38347383,38701278,39032444,39296476,39536653,06